Конфигурация/InformationRegisters/СобытияАналитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СобытияАналитики</Name>
			<Comment>Лог событий пользователей для построения аналитических отчетов.</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолезнаяНагрузка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеБаллов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаБейджа</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзучениеМатериала</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыполнениеПрактическогоЗадания</v8:Type>
						<v8:Type>cfg:DocumentRef.ПопыткаТеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытийАналитики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючСобытия</Name>
					<Comment>Уникальный ключ записи - разводит события с одинаковыми период/пользователь/тема/тип в пределах одной секунды.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ПараметрыIRT.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыIRT</Name>
			<Comment>Параметры b и a модели IRT для заданий банка по версиям калибровки.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТрудностьB</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДискриминативностьA</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКалибровки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКалибровкиЗадания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаКалибровки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоОтветовВВыборке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТестовыеЗадания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияПараметров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/СтатусыКалибровкиЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыКалибровкиЗадания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеКалибровано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИдётКалибровка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Откалибровано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заблокировано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПопыткаТеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПопыткаТеста</Name>
			<Comment>Сессия адаптивного тестирования с пошаговой историей ответов</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяОценкаТета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяSE</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоЗаданий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ответы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерШага</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТестовыеЗадания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Верно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяОценкаТета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяSE</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Catalogs/ТестовыеЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТестовыеЗадания</Name>
			<Comment>Банк тестовых заданий с параметрами IRT (b, a)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТестовыхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формулировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстПредъявления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПараметров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидимыйСтатус</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВариантыОтвета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯвляетсяПравильным</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭталонныйОтвет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/CommonModules/РегламентныеЗаданияОбработчикиПолныеПрава/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Регламентное задание «Обновление рейтинга».
// Пересчитывает рейтинговые позиции обучающихся по всем учебным группам.
//
Процедура ОбновлениеРейтинга() Экспорт

    Контекст = "РегламентныеЗаданияОбработчикиПолныеПрава.ОбновлениеРейтинга";

    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   Группы.Ссылка КАК Ссылка
        |ИЗ
        |   Справочник.УчебныеГруппы КАК Группы
        |ГДЕ
        |   НЕ Группы.ПометкаУдаления");
    Выборка = Запрос.Выполнить().Выбрать();

    Обработано = 0;
    Пока Выборка.Следующий() Цикл
        Попытка
            Геймификация.ОбновитьРейтинг(Выборка.Ссылка);
            Обработано = Обработано + 1;
        Исключение
            ОбщегоНазначенияСерверПриложение.ЗафиксироватьСбой(Контекст,
                "Группа " + Строка(Выборка.Ссылка) + ": " + ОписаниеОшибки());
        КонецПопытки;
    КонецЦикла;

    ОбщегоНазначенияСерверПриложение.ЗафиксироватьСобытие(Контекст,
        "Обновлён рейтинг для учебных групп: " + Обработано);

КонецПроцедуры

// Регламентное задание «Калибровка банка заданий».
// Для каждой темы с накопленной историей не менее ПорогОтветовДляКалибровки
// формирует пакет ответов и вызывает эндпоинт /calibrate_bank микросервиса IRT,
// затем фиксирует новые параметры b и a с увеличением номера версии.
//
Процедура КалибровкаБанкаЗаданий() Экспорт

    Контекст = "РегламентныеЗаданияОбработчикиПолныеПрава.КалибровкаБанкаЗаданий";

    Если Не КлиентIRTСервиса.СервисДоступен() Тогда
        ОбщегоНазначенияСерверПриложение.ЗафиксироватьСобытие(Контекст,
            "Микросервис IRT недоступен — калибровка пропущена.");
        Возврат;
    КонецЕсли;

    Порог = ОбщегоНазначенияСерверПриложение.ЗначениеКонстанты("ПорогОтветовДляКалибровки");
    Если Порог <= 0 Тогда
        Порог = 30;
    КонецЕсли;

    // Один запрос на все темы: ответы по всем сессиям, сгруппированные по теме.
    // Это исключает запрос к базе внутри цикла по темам (обращение к микросервису
    // остаётся поштучным — оно не является запросом к базе данных).
    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   Сессия.Тема        КАК Тема,
        |   Сессия.Обучающийся КАК Пользователь,
        |   Ответы.Задание     КАК Задание,
        |   ВЫБОР КОГДА Ответы.Верно ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК Ответ
        |ИЗ
        |   Документ.ПопыткаТеста.Ответы КАК Ответы
        |   ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПопыткаТеста КАК Сессия
        |       ПО Ответы.Ссылка = Сессия.Ссылка
        |ГДЕ
        |   НЕ Сессия.ПометкаУдаления
        |   И НЕ Сессия.Тема.ПометкаУдаления
        |   И Сессия.Тема <> ЗНАЧЕНИЕ(Справочник.Темы.ПустаяСсылка)
        |   И Ответы.Задание <> ЗНАЧЕНИЕ(Справочник.ТестовыеЗадания.ПустаяСсылка)
        |ИТОГИ ПО
        |   Тема");

    // Максимальные версии параметров по всем заданиям — одним запросом, вне цикла.
    МаксВерсии = ВсеМаксимальныеВерсииПараметров();

    ВсегоОткалибровано = 0;
    ВыборкаТем = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    Пока ВыборкаТем.Следующий() Цикл
        Попытка
            ВсегоОткалибровано = ВсегоОткалибровано
                + КалиброватьТему(ВыборкаТем.Тема, ВыборкаТем.Выбрать(), Порог, МаксВерсии);
        Исключение
            ОбщегоНазначенияСерверПриложение.ЗафиксироватьСбой(Контекст,
                "Тема " + Строка(ВыборкаТем.Тема) + ": " + ОписаниеОшибки());
        КонецПопытки;
    КонецЦикла;

    ОбщегоНазначенияСерверПриложение.ЗафиксироватьСобытие(Контекст,
        "Откалибровано заданий: " + ВсегоОткалибровано);

КонецПроцедуры

// Регламентное задание «Проверка условий бейджей».
// Перебирает обучающихся, у которых были события за последний час,
// и проверяет накопительные условия активации бейджей.
//
Процедура ПроверкаУсловийБейджей() Экспорт

    Контекст = "РегламентныеЗаданияОбработчикиПолныеПрава.ПроверкаУсловийБейджей";
    Граница = ОбщегоНазначенияСерверПриложение.ТекущаяДатаПриложения() - 3600; // последний час

    Запрос = Новый Запрос(
        "ВЫБРАТЬ РАЗЛИЧНЫЕ
        |   СА.Пользователь КАК Пользователь
        |ИЗ
        |   РегистрСведений.СобытияАналитики КАК СА
        |ГДЕ
        |   СА.Период >= &Граница
        |   И СА.Пользователь <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)");
    Запрос.УстановитьПараметр("Граница", Граница);
    Выборка = Запрос.Выполнить().Выбрать();

    Обработано = 0;
    Пока Выборка.Следующий() Цикл
        Попытка
            Геймификация.ПроверитьУсловияБейджей(Выборка.Пользователь);
            Обработано = Обработано + 1;
        Исключение
            ОбщегоНазначенияСерверПриложение.ЗафиксироватьСбой(Контекст,
                "Пользователь " + Выборка.Пользователь + ": " + ОписаниеОшибки());
        КонецПопытки;
    КонецЦикла;

    ОбщегоНазначенияСерверПриложение.ЗафиксироватьСобытие(Контекст,
        "Проверены условия бейджей для пользователей: " + Обработано);

КонецПроцедуры

// Регламентное задание «Очистка устаревших событий аналитики».
// Удаляет записи регистра СобытияАналитики старше 90 дней.
//
Процедура ОчисткаУстаревшихСобытийАналитики() Экспорт

    Контекст = "РегламентныеЗаданияОбработчикиПолныеПрава.ОчисткаУстаревшихСобытийАналитики";
    ДнейХранения = 90;
    Граница = НачалоДня(ОбщегоНазначенияСерверПриложение.ТекущаяДатаПриложения()) - ДнейХранения * 86400;

    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   СА.Период       КАК Период,
        |   СА.Пользователь КАК Пользователь,
        |   СА.Тема         КАК Тема,
        |   СА.ТипСобытия   КАК ТипСобытия
        |ИЗ
        |   РегистрСведений.СобытияАналитики КАК СА
        |ГДЕ
        |   СА.Период < &Граница");
    Запрос.УстановитьПараметр("Граница", Граница);
    Выборка = Запрос.Выполнить().Выбрать();

    Удалено = 0;
    Пока Выборка.Следующий() Цикл
        Попытка
            НаборЗаписей = РегистрыСведений.СобытияАналитики.СоздатьНаборЗаписей();
            НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
            НаборЗаписей.Отбор.Пользователь.Установить(Выборка.Пользователь);
            НаборЗаписей.Отбор.Тема.Установить(Выборка.Тема);
            НаборЗаписей.Отбор.ТипСобытия.Установить(Выборка.ТипСобытия);
            НаборЗаписей.Записать(Истина); // пустой набор по отбору — удаление
            Удалено = Удалено + 1;
        Исключение
            ОбщегоНазначенияСерверПриложение.ЗафиксироватьСбой(Контекст, ОписаниеОшибки());
        КонецПопытки;
    КонецЦикла;

    ОбщегоНазначенияСерверПриложение.ЗафиксироватьСобытие(Контекст,
        "Удалено устаревших событий аналитики: " + Удалено);

КонецПроцедуры

// Регламентное задание «Синхронизация с микросервисом IRT».
// Проверяет доступность микросервиса и фиксирует статус в журнале регистрации.
// Переключение на локальный (резервный) режим расчёта θ происходит автоматически
// на уровне каждого запроса (см. АдаптивноеТестирование.ОценитьТета).
//
Процедура СинхронизацияСМикросервисомIRT() Экспорт

    Контекст = "РегламентныеЗаданияОбработчикиПолныеПрава.СинхронизацияСМикросервисомIRT";

    Если КлиентIRTСервиса.СервисДоступен() Тогда
        ОбщегоНазначенияСерверПриложение.ЗафиксироватьСобытие(Контекст,
            "Микросервис IRT доступен.");
    Иначе
        ОбщегоНазначенияСерверПриложение.ЗафиксироватьСбой(Контекст,
            "Микросервис IRT недоступен. Адаптивное тестирование использует локальный режим.");
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Калибрует задания одной темы по заранее прочитанной выборке её ответов.
//
// Параметры:
//  Тема           - СправочникСсылка.Темы              - калибруемая тема.
//  ВыборкаОтветов - ВыборкаИзРезультатаЗапроса         - детальные записи (Пользователь, Задание, Ответ).
//  Порог          - Число                              - минимальное число ответов для калибровки.
//  МаксВерсии     - Соответствие                       - СправочникСсылка.ТестовыеЗадания -> Число (макс. версия параметров).
//
// Возвращаемое значение:
//  Число - количество откалиброванных заданий.
//
Функция КалиброватьТему(Знач Тема, ВыборкаОтветов, Знач Порог, МаксВерсии)

    Матрица = Новый Массив;
    КартаЗаданий = Новый Соответствие; // идентификатор (строка) -> СправочникСсылка.ТестовыеЗадания
    Пока ВыборкаОтветов.Следующий() Цикл
        Идентификатор = Строка(ВыборкаОтветов.Задание.УникальныйИдентификатор());
        КартаЗаданий.Вставить(Идентификатор, ВыборкаОтветов.Задание);
        Матрица.Добавить(Новый Структура("Пользователь, Задание, Ответ",
            ВыборкаОтветов.Пользователь, Идентификатор, ВыборкаОтветов.Ответ));
    КонецЦикла;

    Если Матрица.Количество() < Порог Тогда
        Возврат 0;
    КонецЕсли;

    Пакет = Новый Структура("Тема, Матрица, Метод", Строка(Тема), Матрица, "JMLE");
    Ответ = КлиентIRTСервиса.КалиброватьБанк(Пакет);
    Если Не Ответ.Успех Тогда
        Возврат 0;
    КонецЕсли;

    НовыеПараметры = Ответ.ТелоОтвета["new_params"];
    Если НовыеПараметры = Неопределено Тогда
        Возврат 0;
    КонецЕсли;

    Откалибровано = 0;
    Для Каждого ПараметрыЗадания Из НовыеПараметры Цикл
        ЗаданиеСсылка = КартаЗаданий.Получить(ПараметрыЗадания["item_id"]);
        Если ЗаданиеСсылка = Неопределено Тогда
            Продолжить;
        КонецЕсли;
        ТекущаяВерсия = МаксВерсии.Получить(ЗаданиеСсылка);
        Если ТекущаяВерсия = Неопределено Тогда
            ТекущаяВерсия = 0;
        КонецЕсли;
        НоваяВерсия = ТекущаяВерсия + 1;
        МаксВерсии.Вставить(ЗаданиеСсылка, НоваяВерсия);
        ЗаписатьПараметрыЗадания(
            ЗаданиеСсылка,
            ПараметрыЗадания["b"],
            ПараметрыЗадания["a"],
            ПараметрыЗадания["n"],
            НоваяВерсия);
        Откалибровано = Откалибровано + 1;
    КонецЦикла;

    Возврат Откалибровано;

КонецФункции

// Возвращает максимальные версии параметров IRT по всем заданиям одним запросом.
//
// Возвращаемое значение:
//  Соответствие - СправочникСсылка.ТестовыеЗадания -> Число (максимальная версия параметров).
//
Функция ВсеМаксимальныеВерсииПараметров()

    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   П.Задание КАК Задание,
        |   МАКСИМУМ(П.ВерсияПараметров) КАК МаксВерсия
        |ИЗ
        |   РегистрСведений.ПараметрыIRT КАК П
        |СГРУППИРОВАТЬ ПО
        |   П.Задание");
    Результат = Новый Соответствие;
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Результат.Вставить(Выборка.Задание, Выборка.МаксВерсия);
    КонецЦикла;
    Возврат Результат;

КонецФункции

// Записывает новую версию параметров IRT задания со статусом «Откалибровано».
//
// Параметры:
//  Задание             - СправочникСсылка.ТестовыеЗадания - калибруемое задание.
//  ТрудностьB          - Число - параметр трудности b.
//  ДискриминативностьA - Число - параметр дискриминативности a.
//  ЧислоОтветов        - Число - размер выборки калибровки.
//  НоваяВерсия         - Число - номер записываемой версии параметров.
//
Процедура ЗаписатьПараметрыЗадания(Знач Задание, Знач ТрудностьB, Знач ДискриминативностьA, Знач ЧислоОтветов, Знач НоваяВерсия)

    НаборЗаписей = РегистрыСведений.ПараметрыIRT.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Задание.Установить(Задание);
    НаборЗаписей.Отбор.ВерсияПараметров.Установить(НоваяВерсия);
    Запись = НаборЗаписей.Добавить();
    Запись.Задание              = Задание;
    Запись.ВерсияПараметров     = НоваяВерсия;
    Запись.ТрудностьB           = ТрудностьB;
    Запись.ДискриминативностьA  = ДискриминативностьA;
    Запись.СтатусКалибровки     = Перечисления.СтатусыКалибровкиЗадания.Откалибровано;
    Запись.ДатаКалибровки       = ОбщегоНазначенияСерверПриложение.ТекущаяДатаПриложения();
    Запись.ЧислоОтветовВВыборке = ЧислоОтветов;
    НаборЗаписей.Записать(Истина);

КонецПроцедуры

#КонецОбласти
